{"title":"Aunt's family thinks I'm a retarded park worker.","link":"https://www.reddit.com/r/IDontWorkHereLady/comments/fz0e7r/aunts_family_thinks_im_a_retarded_park_worker/","sub":"r/IDontWorkHereLady","ups":"2.0k","days":"10","user":"u/rickrolo23","story":["So I just got my wisdoms pulled and I needed to relax. My mom decided the best way.....was forcing me to a wedding yaaaay.  Didn't have to dress fancy, but my face was still swollen and couldn't talk right. Think Chubby Webber's if you need a reference. ","My Attire was tan pants green shirt. Grove Street fa- I like earth tones so it kinda looked like a ranger uniform.","So we get there, aunt's sister is her planner. Starts ordering me to set out chairs didn't even know I was a guest. I heard her go \"god we got that guy?\"  I'm thinking \"what does that mean\" ","So wedding goes through ironically aunt's name is Karen yes she's a psycho. I'll save her stories for another time. Anyways Aunt Karen's sister walks up \"cook didn't show....can your kind ...cook?\" Im like \"yeah sure but what do you mean your kind?\"  She heard mumbles pretty much. I'm cooking burgers and she runs up with a camera \"smile! I'll let your boss know you're....such an amazing helper! \"Bitch what!?\" I said but she heard \"bihwha?\"  My mom walks up \"Rollo I'm glad you're helping here's your Vicodin!\" ","She asked my mom who I was \"oh that's my son Rollo. He had his teeth pulled. He seems kinda angry... Might be the Vicodin.\" She looks sees me and hears me go \"Uncle Bob\"( to protect his name.) ","I ice my face and I can talk a little more normal Karen's sister walks up \"I AM SO SORRY.. (whispers ) I thought you were....you know a disabled employee...\" I glare at her \"IM THE GROOMS GODDAMN NEPHEW... I THOUGHT ID BE KIND HELPING MY FAMILY BUT CLEARLY YOU THINK IM A RETARDED EMPLOYEE...\" she went red \"Dont tell Karen and Bob they will make fun of me....\"  She handed me $5 \"THE FUCK IS THIS!?\" she goes \"your pay for the day....\"  I looked at her \"I'm family not an employee stop this crap.","Update: I know I use the word \"Retard\" a lot but couple things. First off I apologise people are overtly offended but that's what she kept calling me. I'm not going to go back and censor it. Retard/retardation is a disability or part of someone's spectrum of disabilities of delayed intellect, comprehensive skills and motor skills. You censor it you censor a real life disability.  Granted way I put it was insensitive. ","Second, I spent 12 years in special ed with ASD and Im high functioning now and she couldn't of known that. But I been called that by staff and student alike. When I was younger there were kids who'd pelt us with rocks because they didn't want us out of the portables. Trust me I'm well aware of ableism as well as been a long term victim of.","Update: Bob divorced Aunt Karen shortly after the wedding will post a story on her later. Never told him about it but I know Karen's family wasn't fond of Uncle Bob other than the guy had duel retirements."]}