{"title":"I sobbed on the phone with a customer today","link":"https://www.reddit.com/r/talesfromcallcenters/comments/fxk42x/i_sobbed_on_the_phone_with_a_customer_today/","sub":"r/talesfromcallcenters","ups":"1.6k","days":"13","user":"u/adactylousalien","story":["I work for a financial institution. While I do not work in a call center, all of our financial institutions phone calls are answered by personal bankers (including myself). ","I had an older customer call in today. He needed some help paying some bills as he had never done so before. His wife had always taken care of the bills and kept up with everything regarding online banking. I got into the back end of our bill pay system and scheduled the payments for him. This is not typically something our institution would do for the sake of time and liability, but I am empowered to make decisions to help our customers within reason. It took a little bit of time to get everything set up because it was all in his wife's name, but I was able to make it work since it was a joint account. ","Once I finished getting those payments set up for him, he choked back some tears before telling me why he was now doing all of the online banking. His wife is currently in the hospital on a ventilator due to COVID-19, and she is not expected to make it. I sat on the phone and cried with him for a moment. After we ended the call, I placed my phone on DND and walked away for a few minutes. ","My heart is breaking for our customers, our community, and our country right now. Please stay home and wash your hands.","Edit: Thank you all for your words of encouragement and kindness, and thank you for the Reddit awards. ","I hope that all of you take a moment today to think about what you can do to ease the struggle of your neighbor. If you have nothing left to give, that's okay too. Please reach out to someone for support. We are in incredibly trying times, and we all have to remember to be compassionate and patient. Sending love to all of you ❤️"]}